## Plan Result (list-api-cdk-production)

[CI link](https://github.com/Pocket/pocket-monorepo/actions/runs/11625481191)


### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!


<pre><code>Plan: 1 to add, 1 to change, 1 to destroy.</code></pre>

* Update
  * aws_iam_policy.application_ecs_service_ecs-iam_ecs-task-role-policy_6FC89FB6
* Replace
  * aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4



<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4 must be replaced
-/+ resource "aws_ecs_task_definition" "application_ecs_service_ecs-task_461CC9D4" {
      ~ arn                      = "arn:aws:ecs:us-east-1:996905175585:task-definition/ListAPI-Prod:1345" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-east-1:996905175585:task-definition/ListAPI-Prod" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  ~ environment            = [
                        # (4 unchanged elements hidden)
                        {
                            name  = "KINESIS_UNIFIED_EVENT_STREAM"
                            value = "unified_event"
                        },
                      + {
                          + name  = "LIST_IMPORTS_BUCKET"
                          + value = "com.getpocket-prod.list-imports"
                        },
                        {
                            name  = "NODE_ENV"
                            value = "production"
                        },
                        {
                            name  = "OTLP_COLLECTOR_URL"
                            value = "https://otel-collector.readitlater.com:443"
                        },
                      ~ {
                          ~ name  = "SQS_BATCH_DELETE_QUEUE_URL" -> "SQS_IMPORT_BATCH_QUEUE_URL"
                          ~ value = "https://sqs.us-east-1.amazonaws.com/996905175585/ListAPI-Prod-Sqs-Batch-Delete-Consumer-Queue" -> "https://sqs.us-east-1.amazonaws.com/996905175585/AccountDataDeleter-Prod-List-Import-Batches"
                        },
                        {
                            name  = "SQS_PERMLIB_ITEMMAIN_QUEUE_URL"
                            value = "https://sqs.us-east-1.amazonaws.com/996905175585/PermLib-Prod-ItemMain"
                        },
                        # (1 unchanged element hidden)
                    ]
                    name                   = "app"
                    # (10 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ id                       = "ListAPI-Prod" -> (known after apply)
      ~ revision                 = 1345 -> (known after apply)
        tags                     = {
            "app_code"       = "pocket"
            "component_code" = "pocket-listapi"
            "costCenter"     = "Pocket"
            "env_code"       = "prod"
            "environment"    = "Prod"
            "owner"          = "Pocket"
            "service"        = "ListAPI"
        }
        # (12 unchanged attributes hidden)
    }

  # aws_iam_policy.application_ecs_service_ecs-iam_ecs-task-role-policy_6FC89FB6 will be updated in-place
  ~ resource "aws_iam_policy" "application_ecs_service_ecs-iam_ecs-task-role-policy_6FC89FB6" {
        id               = "arn:aws:iam::996905175585:policy/ListAPI-Prod-TaskRolePolicy"
        name             = "ListAPI-Prod-TaskRolePolicy"
      ~ policy           = jsonencode(
          ~ {
              ~ Statement = [
                    # (1 unchanged element hidden)
                    {
                        Action   = [
                            "sqs:SendMessageBatch",
                            "sqs:SendMessage",
                        ]
                        Effect   = "Allow"
                        Resource = [
                            "arn:aws:sqs:us-east-1:996905175585:pocket-publisher-data-queue",
                            "arn:aws:sqs:us-east-1:996905175585:PermLib-Prod-ItemMain",
                        ]
                    },
                  ~ {
                      ~ Resource = "arn:aws:sqs:us-east-1:996905175585:ListAPI-Prod-Sqs-Batch-Delete-Consumer-Queue" -> "arn:aws:sqs:us-east-1:996905175585:AccountDataDeleter-Prod-List-Import-Batches"
                        # (2 unchanged attributes hidden)
                    },
                    {
                        Action   = [
                            "kinesis:PutRecords",
                            "kinesis:PutRecord",
                        ]
                        Effect   = "Allow"
                        Resource = "arn:aws:kinesis:us-east-1:996905175585:stream/unified_event"
                    },
                    {
                        Action   = "events:PutEvents"
                        Effect   = "Allow"
                        Resource = "arn:aws:events:us-east-1:996905175585:event-bus/PocketEventBridge-Prod-Shared-Event-Bus"
                    },
                  + {
                      + Action   = "s3:ListBucket"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::com.getpocket-prod.list-imports"
                    },
                  + {
                      + Action   = [
                          + "s3:PutObject",
                          + "s3:GetObject",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::com.getpocket-prod.list-imports/*"
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        tags             = {
            "app_code"       = "pocket"
            "component_code" = "pocket-listapi"
            "costCenter"     = "Pocket"
            "env_code"       = "prod"
            "environment"    = "Prod"
            "owner"          = "Pocket"
            "service"        = "ListAPI"
        }
        # (7 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

Changes to Outputs:
  ~ ecs-task-arn           = "arn:aws:ecs:us-east-1:996905175585:task-definition/ListAPI-Prod:1345" -> (known after apply)
```

</details>









<!-- github-comment: {"Command":"plan","JobName":"plan","PRNumber":907,"Program":"tfcmt","SHA1":"ebeb1fe824512eca68b37208a06250f3e1cb9138","Target":"list-api-cdk-production","Vars":{},"WorkflowName":"List API"} -->